sdy4011/nrf52_ble_example/nrf52_ble_saadc/examples/main.c
#define MAX_TEST_DATA_BYTES     (15U)                /**< max number of test bytes to be used for tx and rx. */
#define UART_TX_BUF_SIZE 256                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE 256                         /**< UART RX buffer size. */
#define SAMPLE_IN_BUFFER 126												 /**<saadc buffer for 6 channel in which 6 bytes are allocated to 1 channel*/
//#define NRF_SDH_BLE_VS_UUID_COUNT 1

APP_TIMER_DEF(our_test_id);  /**<my timer test.*/
BLE_LBS_DEF(m_lbs);          /**<lbs test. is equivalent to static ble_bls_t m_lbs*/
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                             /**< Advertising module instance. */

//temporary data storage;
//APP_TIMER_DEF(notify_timer);

typedef struct
{
	uint16_t conn_handle;
	ble_lbs_t * p_lbs;
	uint8_t a_data[126];
	uint8_t a_data_flag;
}tem_save;

static tem_save ts={0};
static uint16_t REPREAT_TIMES = 21; /*semg repeat times*/
static uint16_t CHANNLES			 =6  ;/*semg channels*/
static uint16_t INTERVAL_TIME  =21  ;/*intervale time*/
static uint8_t m_interval = 15; /*memset t_data interval time*/
static uint8_t  a_data[126]={0};
static nrf_saadc_value_t m_buffer_pool[2][SAMPLE_IN_BUFFER];/*saadc buffer*/
static uint32_t m_adc_evt_counter = 0; /*sample number*/
static const nrf_drv_timer_t saadc_timer = NRF_DRV_TIMER_INSTANCE(1);//*saadc tiemr*/
static const nrfx_timer_t r_timer = NRFX_TIMER_INSTANCE(2); // real timer
static nrf_ppi_channel_t m_ppi_channel;
static uint8_t sampling_flag = 0;
uint64_t start_time = 0;

/*saadc callback*/
static void saadc_callback(nrfx_saadc_evt_t const*p_evt)
{
	float val;
	if(p_evt->type == NRFX_SAADC_EVT_DONE)//*buffer full evt
	{
		ret_code_t err_code;
		err_code = nrfx_saadc_buffer_convert(p_evt->data.done.p_buffer,SAMPLE_IN_BUFFER);
		APP_ERROR_CHECK(err_code);
		for(int i=0;i<126;i++)
		{
			if(p_evt->data.done.p_buffer[i]<0)
			{
				p_evt->data.done.p_buffer[i]=0;
			}
		}
		memcpy(ts.a_data,p_evt->data.done.p_buffer,126);
		ts.a_data_flag =1;//it has been written
//	  ble_lbs_on_button_change(ts.conn_handle,ts.p_lbs,ts.a_data);
		
	}
	else
	{
	}
}


static void saadc_timeout(nrf_timer_event_t evt_type,void *p_context)
{
//	if(UINT64_MAX !=start_time)
//	{	
//		start_time++;
//	}
//	else{
//		start_time = 0;
//	}
//	switch (evt_type)
//    {
//        case NRF_TIMER_EVENT_COMPARE0://???0??
//            break;
//        default:
//            break;
//    }
}

static void r_timeout(nrf_timer_event_t evt_type,void *p_context)
{
		if(UINT64_MAX !=start_time)
	{	
		start_time++;
	}
		else{
		start_time = 0;
	}
}

static void saadc_sampling_event_enable(void)
{
	
	
	ret_code_t err_code;
	err_code = nrfx_ppi_channel_enable(m_ppi_channel);
	APP_ERROR_CHECK(err_code);
}

static void saadc_sampling_event_disable(void)
{
	ret_code_t err_code;
	err_code = nrfx_ppi_channel_disable(m_ppi_channel);
	APP_ERROR_CHECK(err_code);
}

static void saadc_timer_enable(void)
{
		nrf_drv_timer_enable(&saadc_timer);

}

static void saadc_timer_disable(void)
{
		nrf_drv_timer_disable(&saadc_timer);
}
	
static void r_timer_enable(void)
{
	nrfx_timer_enable(&r_timer);
}

static void r_timer_disable(void)
{
	nrfx_timer_disable(&r_timer);
}

static void saadc_sampling_event_init(void)
{
	ret_code_t err_code;
	//configure saadc_timer 
	nrf_drv_timer_config_t timercfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
	err_code = nrf_drv_timer_init(&saadc_timer,&timercfg,saadc_timeout);
	APP_ERROR_CHECK(err_code);
	uint32_t ticks1 = nrf_drv_timer_ms_to_ticks(&saadc_timer,m_interval);
	nrf_drv_timer_extended_compare(&saadc_timer,NRF_TIMER_CC_CHANNEL0,ticks1,NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,false);

	err_code = nrf_drv_timer_init(&r_timer,&timercfg,r_timeout);
	APP_ERROR_CHECK(err_code);
	uint32_t ticks2 = nrf_drv_timer_ms_to_ticks(&r_timer,1);
	nrf_drv_timer_extended_compare(&r_timer,NRF_TIMER_CC_CHANNEL0,ticks2,NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,true);
	
	err_code = nrf_drv_ppi_init();
//	if(err_code == NRF_SUCCESS)
//	{
//		NRF_LOG_INFO("ppi init succeed");
//	}
//	else
//	{
//		NRF_LOG_INFO("ppi init failed");
//	}
	APP_ERROR_CHECK(err_code);
	//set task and event for ppi channel
	uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&saadc_timer,NRF_TIMER_CC_CHANNEL0);
	uint32_t saadc_sample_event_addr = nrf_drv_saadc_sample_task_get();
	//get a PPI channel 
	err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
	APP_ERROR_CHECK(err_code);
	//assign addrs of task and event for ppi channel
	err_code = nrf_drv_ppi_channel_assign(m_ppi_channel,timer_compare_event_addr,saadc_sample_event_addr);
	APP_ERROR_CHECK(err_code);
	
}
	
	
static void saadc_init(void)
{
	ret_code_t err_code;
	nrf_saadc_channel_config_t a0 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN0);
	
	nrf_saadc_channel_config_t a1 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN1);
	nrf_saadc_channel_config_t a2 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN2);
	nrf_saadc_channel_config_t a3 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN5);
	nrf_saadc_channel_config_t a4 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN4);
	nrf_saadc_channel_config_t a5 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN3);
	
	a0.acq_time = NRF_SAADC_ACQTIME_3US;
	a1.acq_time = NRF_SAADC_ACQTIME_3US;
	a2.acq_time = NRF_SAADC_ACQTIME_3US;
	a3.acq_time = NRF_SAADC_ACQTIME_3US;
	a4.acq_time = NRF_SAADC_ACQTIME_3US;
	a5.acq_time = NRF_SAADC_ACQTIME_3US;
//	a0.mode = NRF_SAADC_MODE_DIFFERENTIAL;
//	a1.mode = NRF_SAADC_MODE_DIFFERENTIAL;
//	a2.mode = NRF_SAADC_MODE_DIFFERENTIAL;
//	a3.mode = NRF_SAADC_MODE_DIFFERENTIAL;
//	a4.mode = NRF_SAADC_MODE_DIFFERENTIAL;
//	a5.mode = NRF_SAADC_MODE_DIFFERENTIAL;
	err_code = nrf_drv_saadc_init(NULL,saadc_callback);
	APP_ERROR_CHECK(err_code);
	err_code = nrfx_saadc_channel_init(0,&a0);
	APP_ERROR_CHECK(err_code);
	err_code = nrfx_saadc_channel_init(1,&a1);
	APP_ERROR_CHECK(err_code);
	err_code = nrfx_saadc_channel_init(2,&a2);
	APP_ERROR_CHECK(err_code);
	err_code = nrfx_saadc_channel_init(3,&a3);
	APP_ERROR_CHECK(err_code);
	err_code = nrfx_saadc_channel_init(4,&a4);
	APP_ERROR_CHECK(err_code);
	err_code = nrfx_saadc_channel_init(5,&a5);
	APP_ERROR_CHECK(err_code);
	err_code = nrfx_saadc_buffer_convert(m_buffer_pool[0],SAMPLE_IN_BUFFER);
	APP_ERROR_CHECK(err_code);
	err_code = nrfx_saadc_buffer_convert(m_buffer_pool[1],SAMPLE_IN_BUFFER);
	APP_ERROR_CHECK(err_code);
//	NRF_LOG_INFO("saadc init succeed");
}
	
	


