sdy4011/nrf52_ble_example/nrf52_ble_saadc/examples/main.c
static void timeout(void *p)
{
	UNUSED_PARAMETER(p);
	ret_code_t err_code;
////	NRF_LOG_INFO("enter notify timer");
////		nrfx_saadc_sample(); // start a saadc sample
//	uint8_t val_a0;
//	uint8_t val_a1;
//	uint8_t val_a2;
//	uint8_t val_a3;
//	uint8_t val_a4;
//	uint8_t val_a5;
//	//read ana value 
//	if(m_adc_evt_counter<126)
//	{
//		uint32_t o0 = bsp_board_a_read(0);
//		val_a0 = o0*255;//a0
////		NRF_LOG_INFO("original ao:%#x,after ao:%#x",o0,val_a0);
//		val_a1 = bsp_board_a_read(1);//a1
//		val_a2 = bsp_board_a_read(2);//a2
//		val_a3 = bsp_board_a_read(3);//a3
//		val_a4 = bsp_board_a_read(4);//a4
//		val_a5 = bsp_board_a_read(5);//a5
//		ts.a_data[m_adc_evt_counter++]=val_a0;
//		ts.a_data[m_adc_evt_counter++]=val_a1;
//		ts.a_data[m_adc_evt_counter++]=val_a2;
//		ts.a_data[m_adc_evt_counter++]=val_a3;
//		ts.a_data[m_adc_evt_counter++]=val_a4;
//		ts.a_data[m_adc_evt_counter++]=val_a5;
//		NRF_LOG_INFO("a0:%d,a1:%d,a2:%d,a3:%d,a4:%d,a5:%d",val_a0,val_a1,val_a2,val_a3,val_a4,val_a5);
//	}
//	else
//	{
//		m_adc_evt_counter = 0;
//	}
//	err_code = ble_lbs_on_button_change(ts.conn_handle,ts.p_lbs,ts.a_data);
//	if(err_code != NRF_SUCCESS)
//	{
//		char a[10];
//		int tem = (int)err_code;
//		sprintf(a,"%#x",tem);
//		
//		NRF_LOG_INFO(a);
//	}
}


static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

/* YOUR_JOB: Declare all services structure your application is using
 *  BLE_XYZ_DEF(m_xyz);
 */

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] =                                               /**< Universally unique service identifiers. */
{		
		
//	  {LBS_UUID_SERVICE,BLE_UUID_TYPE_BLE},
//    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
	{LBS_UUID_SERVICE,BLE_UUID_TYPE_VENDOR_BEGIN}
};


static void advertising_start(bool erase_bonds);


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_disconnect_on_sec_failure(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}

/**my timer timeout handle test*/
static void timeout_test(void *p)
{
	UNUSED_PARAMETER(p);
	if(ts.a_data_flag)
	{
		
		ret_code_t err_code;
		err_code = ble_lbs_on_button_change(ts.conn_handle,ts.p_lbs,ts.a_data);
//		NRF_LOG_INFO("err:%d",err_code);
	}

	//deal
//	NRF_LOG_INFO("??");
}

//static void saadc_timeout_callback(void)
//{
//}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
		err_code = app_timer_create(&our_test_id,APP_TIMER_MODE_REPEATED,timeout_test);
////		
		APP_ERROR_CHECK(err_code);
//		err_code =  app_timer_create(&notify_timer,APP_TIMER_MODE_REPEATED,timeout);
//		APP_ERROR_CHECK(err_code);
//	  err_code = app_timer_create(&saadc_timer,APP_TIMER_MODE_REPEATED,saadc_timeout_callback);
    // Create timers.

    /* YOUR_JOB: Create any timers to be used by the application.
                 Below is an example of how to create a timer.
                 For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
                 one.
       ret_code_t err_code;
       err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
       APP_ERROR_CHECK(err_code); */
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */
		err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_WATCH_SPORTS_WATCH);														
    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
		//opt event
//		ble_opt_t opt;
//		memset(&opt,0x00,sizeof(opt));
//		err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT,&opt);
//		APP_ERROR_CHECK(err_code);																		
																					
																					
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


