sdy4011/nrf52_ble_example/nrf52_ble_saadc/examples/main.c
/**@brief Function for handling the YYY Service events.
 * YOUR_JOB implement a service handler function depending on the event the service you are using can generate
 *
 * @details This function will be called for all YY Service events which are passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 *
static void on_yys_evt(ble_yy_service_t     * p_yy_service,
                       ble_yy_service_evt_t * p_evt)
{
    switch (p_evt->evt_type)
    {
        case BLE_YY_NAME_EVT_WRITE:
            APPL_LOG("[APPL]: charact written with value %s. ", p_evt->params.char_xx.value.p_str);
            break;

        default:
            // No implementation needed.
            break;
    }
}
*/

/*data acquisition*/
static uint8_t *data_acq(void)
{
}

/*notify timer init*/
//static void notify_timer_init(void)
//{
//		ret_code_t err_code;
//		err_code =  app_timer_create(&notify_timer,APP_TIMER_MODE_REPEATED,timeout);
//		APP_ERROR_CHECK(err_code);
//}

/*my ble_lbs write handler test */
static void led_write_handler(ble_lbs_t * p_lbs, ble_evt_t const * p_ble_evt)
{
		ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
		if ((p_evt_write->handle == p_lbs->led_char_handles.value_handle)&&(p_evt_write->len == 1))
		{
				if(p_evt_write->data[0]==0x01)
			{
				
				uint16_t conn_handle = p_ble_evt->evt.common_evt.conn_handle;
				memset(&ts,0,sizeof(ts));
				ts.conn_handle = conn_handle;
				ts.p_lbs = p_lbs;
				saadc_timer_enable();//start ppi to scan a0-a5 and memset ts.data
				app_timer_start(our_test_id,APP_TIMER_TICKS(INTERVAL_TIME),NULL);//start notify timer
				sampling_flag = 1;
//				bsp_board_led_on(1);
//				NRF_LOG_INFO("REV LED ON");
			}
			else if(p_evt_write->data[0]==0x02)
			{
				//other command
				ts.a_data_flag = 0;
				app_timer_stop(our_test_id);
				saadc_timer_disable();
				sampling_flag = 0;
//				bsp_board_led_off(1);
//				NRF_LOG_INFO("REV LED OFF");
			}
			else
			{
				ts.a_data_flag = 0;
				app_timer_stop(our_test_id);
				saadc_timer_disable();
				sampling_flag = 0;
//				bsp_board_led_off(1);
//				NRF_LOG_INFO("REV LED OFF");
			}
		}
}

/*my notify handler test*/
static void notify_handler(uint16_t conn_handle,ble_lbs_t *p_lbs,uint8_t led_state)
{
	ret_code_t err_code;
}

/*my disconnect handler*/
static void disconnect_handler(ble_lbs_t * p_lbs, ble_evt_t const * p_ble_evt)
{
	ts.a_data_flag = 0;
	app_timer_stop(our_test_id);
	saadc_timer_disable();
	sampling_flag = 0;
}
/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t         err_code;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);
    

    /* YOUR_JOB: Add code to initialize the services used by the application.
       ble_xxs_init_t                     xxs_init;
       ble_yys_init_t                     yys_init;

       // Initialize XXX Service.
       memset(&xxs_init, 0, sizeof(xxs_init));

       xxs_init.evt_handler                = NULL;
       xxs_init.is_xxx_notify_supported    = true;
       xxs_init.ble_xx_initial_value.level = 100;

       err_code = ble_bas_init(&m_xxs, &xxs_init);
       APP_ERROR_CHECK(err_code);

       // Initialize YYY Service.
       memset(&yys_init, 0, sizeof(yys_init));
       yys_init.evt_handler                  = on_yys_evt;
       yys_init.ble_yy_initial_value.counter = 0;

       err_code = ble_yy_service_init(&yys_init, &yy_init);
       APP_ERROR_CHECK(err_code);
     */
		 ble_lbs_init_t ble_init = {0};
		 ble_init.led_write_handler = led_write_handler;
		 ble_init.notify_handler = notify_handler;
		 ble_init.disconnect_handler = disconnect_handler;
		 err_code = ble_lbs_init(&m_lbs,&ble_init);
		 APP_ERROR_CHECK(err_code);
}



/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    ret_code_t             err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting timers.
 */
static void application_timers_start(void)
{
    /* YOUR_JOB: Start your timers. below is an example of how to start a timer.
       ret_code_t err_code;
       err_code = app_timer_start(m_app_timer_id, TIMER_INTERVAL, NULL);
       APP_ERROR_CHECK(err_code); */
//		ret_code_t err_code;
//		err_code = app_timer_start(our_test_id,APP_TIMER_TICKS(1),NULL);//200ms
//		APP_ERROR_CHECK(err_code);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    ret_code_t err_code;

