sdy4011/nrf52_ble_example/nrf52_ble_saadc/examples/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
//    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
//    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;
		init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids)/sizeof(m_adv_uuids[0]);
		init.srdata.uuids_complete.p_uuids = m_adv_uuids;
    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION; //adv timeout time

    init.evt_handler = on_adv_evt;
	
		//**scan callback


    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
			/*ana pin init*,my define*/
//		bsp_board_a_all_init_input();
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
//				ble_advertising_conn_cfg_tag_set(&m_advertising,);
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}



void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
#if defined (UART_PRESENT)
        .baud_rate    = NRF_UART_BAUDRATE_115200
#else
        .baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_error_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
    // Initialize.
    log_init();
		uart_init();
		printf("hello");
//		while(true){
//				printf("!!");
//					nrf_delay_ms(500);
//		}
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
		services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();
    // Start execution.
    NRF_LOG_INFO("Template example started.");
//    application_timers_start();
    advertising_start(erase_bonds);
		saadc_sampling_event_init();
		saadc_init();
		saadc_sampling_event_enable();
		r_timer_enable();//start system time
		
//		uint64_t pre_t = 0;
//		uint64_t cur_t = start_time;
//		nrf_saadc_value_t a0;
//		nrf_saadc_value_t a1;
//		nrf_saadc_value_t a2;
//		nrf_saadc_value_t a3;
//		nrf_saadc_value_t a4;
//		nrf_saadc_value_t a5;
//		uint8_t rp = 0;
//		ret_code_t err_code;
//		//test rate 
//		uint8_t 	test_data[126]={0};
//		uint32_t t_len_sent = 0;
//		uint64_t c_t = 0;
//		uint8_t f_t = 0;
    for (;;)
    {
        idle_state_handle();
				
//			while(sampling_flag)
//			{		
//				if(f_t ==0)
//				{
//					c_t = start_time;
//					f_t++;
//				}
//				idle_state_handle();
//				err_code = ble_lbs_on_button_change(ts.conn_handle,ts.p_lbs,ts.a_data);
//				if (err_code == NRF_SUCCESS)
//				{
//					t_len_sent+=126;
//				}
//				NRF_LOG_INFO("time:%d,bytes send:%d Bytes,avg speed:%d KB/s",start_time,t_len_sent,t_len_sent/(start_time-c_t));
//			}
		/********************************* real ***********************************/		
//				if(rp!=SAMPLE_IN_BUFFER)
//				{
//					nrfx_saadc_sample_convert(0,&a0);
//					nrfx_saadc_sample_convert(1,&a1);
//					nrfx_saadc_sample_convert(2,&a2);
//					nrfx_saadc_sample_convert(3,&a3);
//					nrfx_saadc_sample_convert(4,&a4);
//					nrfx_saadc_sample_convert(5,&a5);
//					if(a0<0)a0=0;
//					if(a1<0)a1=0;
//					if(a2<0)a2=0;
//					if(a3<0)a3=0;
//					if(a4<0)a4=0;
//					if(a5<0)a5=0;
//					ts.a_data[rp++]=a0;
//					ts.a_data[rp++]=a1;
//					ts.a_data[rp++]=a2;
//					ts.a_data[rp++]=a3;
//					ts.a_data[rp++]=a4;
//					ts.a_data[rp++]=a5;
////					NRF_LOG_INFO("a0:%d,a1:%d,a2:%d,a3:%d,a4:%d,a5:%d",a0,a1,a2,a3,a4,a5);
//				}
//				else
//				{
////				nrfx_saadc_sample();
//					cur_t = start_time;
//					while(cur_t-pre_t<INTERVAL_TIME)
//					{
//						cur_t = start_time;
//					}
//					pre_t = start_time;
//					err_code = ble_lbs_on_button_change(ts.conn_handle,ts.p_lbs,ts.a_data);
////						NRF_LOG_INFO("errcode :%d",err_code);
//					rp = 0;
//				}

//			}
    }
}


/**
 * @}
 */
